{
    "headerText": "Constantly catching up in Frontend engineering",
    "aboutMe": {
        "introduce": "As a self-taught frontend engineer, I possess the qualities of a quick learner and an effective team player. I have a strong desire to continuously expand my skill set and am always eager to share my knowledge with others. Currently, I am employed at TikTok as a frontend engineer, where I am committed to delivering exceptional results.",
        "frontFrame": "I have extensive experience in developing products using the React + Flux/Redux ecosystem, including proficiency in React Hooks and Redux-Saga. Additionally, I have worked with Backbone.js and jQuery.",
        "beExp": "I possess expertise in developing Backend-For-Frontend (BFF) using Node.js and Express.js, as well as Golang and Gin.",
        "styleExp": "With extensive experience in Sass and CSS Modules, I am now focusing on mastering Emotion to enhance my web styling abilities.",
        "buildEnv": "With knowledge of the development process, I have hands-on experience in configuring webpack, integrating Grunt and RequireJS, and creating GitLab CI/CD YAML files."
    },
    "workExperience": {
        "tiktok": {
            "projects": {
                "contentSafetyPlatform": {
                    "name": "Operating platform for TikTok content safety",
                    "target": "Develop a web-based platform to empower content reviewers to effectively identify and remove any unsafe content on TikTok with greater efficiency.",
                    "value": "Reduce the average review time for content reviewers by 30% to 40%.",
                    "details": [
                        "Implement new features and resolve bugs in frontend projects by efficiently debugging existing code using React and MobX.",
                        "Refactor the codebase to enhance the platform's efficiency and overall performance.",
                        "Elevate unit test coverage from its current level of less than 10% to a target of 70% for all base components.",
                        "Implement BFF (Backend for Frontend) to reduce the number of requests to backend server."
                    ]
                },
                "searchFeature": {
                    "name": "New search platform",
                    "target": "A cutting-edge search platform designed to enhance the efficiency of content reviewers in identifying and locating potentially harmful content on TikTok.",
                    "value": "Empower content reviewers with multi-level search filters, enabling them to swiftly and efficiently locate relevant content. Building a comprehensive search platform from the ground up, ensuring its seamless transition from development to production.",
                    "details": [
                        "Built a comprehensive search platform from the ground up, taking it from conception to full-scale production.",
                        "Configured the development environment utilizing webpack, Babel, ESLint, Prettier, lint-staged, and Jest.",
                        "Delivered the entire project within a tight timeline of two weeks, including rapid development and seamless deployment to production.",
                        "Implemented a permission control system for both the frontend and BFF of the platform to ensure that content reviewers only have access to the approved content they are authorized to view, and they cannot make any unauthorized requests.",
                        "Modularize the entire platform to facilitate its seamless integration and extension to other projects."
                    ]
                }
            }
        },
        "xfers": {
            "projects": {
                "indoPayment": {
                    "name": "Payment system for indonesia area",
                    "target": "Implement web GUI for store owners in Indonesia, so they can easily manage the whole xfers payment dashboard.",
                    "value": "Provide an easy-to-use and intuitive user interface for users and reduce the learning curve.",
                    "details": [
                        "Implement new features and debug existing code with React and Redux."
                    ]
                }
            }
        },
        "senao": {
            "projects": {
                "enGeniusCloud": {
                    "name": "Web GUI of EnGenius Cloud",
                    "target": "Develop a user-friendly web graphical user interface to efficiently manage Senao Networks' enterprise-level switch and access point devices.",
                    "value": "By streamlining the process of configuring devices to the enterprise network, we save our clients a significant amount of time, allowing them to focus on the core aspects of their business operations.",
                    "details": [
                        "Design a comprehensive Backup and Switch Template page. The Backup page will allow for seamless backup of the network configuration, while the Switch Template page will serve as a platform for creating and customizing Switch Templates that can be uniformly applied to all switches within the network, regardless of their model",
                        "Refactor the components using React Hooks for improved maintenance and ease of use.",
                        "Migrate existing code from classical components to React Hooks and also in writing new features utilizing the latest React Hooks technology."
                    ]
                },
                "selfHostedManagementTool": {
                    "name": "Enterprise-Level Network Management Tool: A Self-Hosted Web GUI Solution",
                    "target": "Design a user-friendly web graphical user interface that streamlines the management of Senao Networks' enterprise-level switch and access point devices. Of utmost importance is ensuring the privacy of our customers by allowing them to host the system on their own servers.",
                    "value": "By streamlining the process of configuring devices to the enterprise network, we save our clients a significant amount of time, allowing them to focus on the core aspects of their business operations.",
                    "details": [
                        "Migrate from Flux to Redux, and rewrite the related functions to ensure seamless integration. I effectively managed asynchronous functions and side effects using Redux-Saga, resulting in an optimized and efficient system.",
                        "Implement react-i18next to create a multilingual website."
                    ]
                }
            }
        },
        "latticeWork": {
            "projects": {
                "amber": {
                    "name": "Web GUI of AmberPRO and Amber X",
                    "target": "Develop and integrate a web-based graphical user interface to efficiently manage AmberPRO and Amber X, a combined network-attached storage and router system.",
                    "value": "Clients can effortlessly set up and configure their devices using the user-friendly web graphical interface.",
                    "details": [
                        "Implement new features and fix existing code issues using Backbone.js and jQuery.",
                        "Collaborate with UI/UX designers and Product Managers to assess and implement effective software solutions for products."
                    ]
                },
                "migrateDevelopmentEnvironment": {
                    "name": "Migrate Development Environment",
                    "target": "Support the latest ES6+ features and migrate deprecated Bower dependencies to npm to ensure a modern and maintainable codebase.",
                    "value": "Efficiently reduce the time spent on installing packages and accelerate the development process for creating high-quality products.",
                    "details": [
                        "Migrate package manager from Bower to npm",
                        "Migrate module bundler from Grunt+RequireJS to webpack",
                        "Integrate Babel and ESLint to support ES6+ features"
                    ]
                }
            }
        },
        "nuk": {
            "companyName": "National University of Kaohsiung",
            "jobTitle": "Life Sciences, Bachelor's Degree"
        }
    },
    "common": {
        "target": "Target",
        "value": "Value",
        "details": "Details"
    }
}