{
    "headerText": "Constant catching up in Frontend engineering",
    "aboutMe": {
        "introduce": "Hi! I am a self-taught frontend engineer. Due to the self-taught experience, I am confident with solving problems by myself and learning new skills quickly.",
        "frontFrame": "Currently I develop products with tools from React + Flux/Redux ecosystem, including React Hook and Redux-Saga, and having experience of Backbone.js and jQuery.",
        "styleExp": "Experienced with Sass and CSS Modules, I am working on studying Emotion to improve my web styling skills.",
        "buildEnv": "Knowing the development process: I have the experience of setting up webpack, Grunt + RequireJS and GitLab CI/CD YAML files."
    },
    "workExperience": {
        "senao": {
            "projects": {
                "enGeniusCloud": {
                    "name": "Web GUI of EnGenius Cloud",
                    "target": "Implement web GUI to manage Enterprise-Level switch and access point devices produces by Senao Networks.",
                    "value": "The Enterprise-Level devices take about 85% of Senao Networks' income.",
                    "details": [
                        "Design the whole Backup and Switch Template page.",
                        "Rewrite the Add Node modal.",
                        "Maintain existing code."
                    ]
                },
                "selfHostedManagementTool": {
                    "name": "Web GUI of a self-hosted management tool for Enterprise-Level networks",
                    "target": "Implement a self-hosted version of EnGenius Cloud, that clients can run on their own server.",
                    "value": "Under development.",
                    "details": [
                        "Migrate from Flux to Redux and rewrite related functions.",
                        "Communicate with UI/UX and Product Manager and evaluate product software implementation methods"
                    ]
                }
            }
        },
        "latticeWork": {
            "projects": {
                "amber": {
                    "name": "Web GUI of AmberPRO and Amber X",
                    "target": "Implement the embedded web GUI to manage AmberPRO and Amber X, a combination of NAS and router.",
                    "value": "Clients must configure devices through web GUI.",
                    "details": [
                        "Implement new features and maintain existing code",
                        "Communicate with UI/UX and Product Manager and evaluate product software implementation methods"
                    ]
                },
                "migrateDevelopmentEnvironment": {
                    "name": "Migrate Development Environment",
                    "target": "Support ES6+ features and give up the deprecated Bower.",
                    "value": "Save a lot of time on finding packages and product development.",
                    "details": [
                        "Migrate package manager from Bower to npm",
                        "Migrate module bundler from Grunt+RequireJS to webpack",
                        "Integrate Babel and ESLint to support ES6+ features"
                    ]
                }
            }
        },
        "nuk": {
            "companyName": "National University of Kaohsiung",
            "jobTitle": "Life Sciences, Bachelor's Degree"
        }
    },
    "common": {
        "target": "Target",
        "value": "Value",
        "details": "Details"
    }
}