{
    "headerText": "Constantly catching up in Frontend engineering",
    "aboutMe": {
        "introduce": "Hi! I am a self-taught frontend engineer. Due to the self-taught experience, I am confident with solving problems by myself and learning new skills quickly.",
        "frontFrame": "Currently I develop products with tools from React + Flux/Redux ecosystem, including React Hook and Redux-Saga, and having experience of Backbone.js and jQuery.",
        "styleExp": "Experienced with Sass and CSS Modules, I am working on studying Emotion to improve my web styling skills.",
        "buildEnv": "Knowing the development process: I have the experience of setting up webpack, Grunt + RequireJS and GitLab CI/CD YAML files."
    },
    "workExperience": {
        "tiktok": {
            "projects": {
                "contentSafetyPlatform": {
                    "name": "Operating platform for TikTok content safety",
                    "target": "Implement a web platform for content reviewers so they can target and eliminate unsafe contents on TikTok more efficiently.",
                    "value": "Cut down 30% to 40% of the time for content reviewers to review contents averagely.",
                    "details": [
                        "Implement new features and debug existing codes for front-end projects.",
                        "Refactor the codebase to improve the performance of the platform.",
                        "Increase unit test coverage to 70% of base components.",
                        "Implement BFF (Backend for Frontend) to reduce the number of requests to backend server."
                    ]
                },
                "searchFeature": {
                    "name": "New search platform",
                    "target": "A faster search platform for content reviewers to locate unsafe contents on TikTok.",
                    "value": "Provide multi-level search filters to content reviewers, so they can locate contents more efficiently.",
                    "details": [
                        "Construct the whole search platform from zero to production.",
                        "Setup the development environment with webpack, Babel, ESLint, Prettier, lint-staged and Jest.",
                        "Rapidly develop the whole project and deploy it to production in 2 weeks.",
                        "Introduced permission control to both FE and BFF of the platform, so the content reviewers can only access the contents they are allowed to see and not able to send any unauthorized requests.",
                        "Componentize the whole platform, so the platform can be easily extended to other projects."
                    ]
                }
            }
        },
        "xfers": {
            "projects": {
                "indoPayment": {
                    "name": "Payment system for indonesia area",
                    "target": "Implement web GUI for store owners in indonesia, so they can easily manage whole xfers payment dashboard.",
                    "value": "Provide an easy-to-use and intuitive user interface for users and reduce the learning curve.",
                    "details": [
                        "Implement new features and debug existing code with React and Redux."
                    ]
                }
            }
        },
        "senao": {
            "projects": {
                "enGeniusCloud": {
                    "name": "Web GUI of EnGenius Cloud",
                    "target": "Implement web GUI to manage Enterprise-Level switch and access point devices produces by Senao Networks.",
                    "value": "Save a lot of time on configuring devices to the whole enterprise network, so clients can focus on their business.",
                    "details": [
                        "Design the whole Backup and Switch Template page. The Backup page can backup the configuration of the network. The Switch Template page is used to construct Switch Templates, which can be applied to all switches in the network with certain models.",
                        "Rewrite the Add Node modal with React Hooks, which is easier to maintain.",
                        "Migrate existing code from classical components to React Hooks and write new features with React Hooks."
                    ]
                },
                "selfHostedManagementTool": {
                    "name": "Web GUI of a self-hosted management tool for Enterprise-Level networks",
                    "target": "Implement a self-hosted version of EnGenius Cloud, that clients can run on their own servers.",
                    "value": "Under development.",
                    "details": [
                        "Migrate from Flux to Redux and rewrite related functions, handling async functions and side effects with Redux-Saga.",
                        "Integrate react-i18next to construct a multi-language website.",
                        "Communicate with UI/UX and Product Manager and evaluate product software implementation methods"
                    ]
                }
            }
        },
        "latticeWork": {
            "projects": {
                "amber": {
                    "name": "Web GUI of AmberPRO and Amber X",
                    "target": "Implement the embedded web GUI to manage AmberPRO and Amber X, a combined device of router and NAS.",
                    "value": "Clients can easily manage their network and NAS devices with a intuitive web GUI.",
                    "details": [
                        "Implement new features and debug existing code with Backbone.js and jQuery",
                        "Communicate with UI/UX and Product Manager and evaluate product software implementation methods"
                    ]
                },
                "migrateDevelopmentEnvironment": {
                    "name": "Migrate Development Environment",
                    "target": "Support ES6+ features and give up the deprecated Bower.",
                    "value": "Save a lot of time on finding packages and product development.",
                    "details": [
                        "Migrate package manager from Bower to npm",
                        "Migrate module bundler from Grunt+RequireJS to webpack",
                        "Integrate Babel and ESLint to support ES6+ features"
                    ]
                }
            }
        },
        "nuk": {
            "companyName": "National University of Kaohsiung",
            "jobTitle": "Life Sciences, Bachelor's Degree"
        }
    },
    "common": {
        "target": "Target",
        "value": "Value",
        "details": "Details"
    }
}